GigaDevice-GD32-MCU/GD32A508_Firmware_Library/Firmware/GD32A508_standard_peripheral/Include/gd32a508_adc.h
/* ADC_IOFFx x=0..3 */
#define ADC_IOFFX_IOFF                  BITS(0, 11)                      /*!< data offset for inserted channel x */

/* ADC_WDHT */
#define ADC_WDHT0_WDHT0                 BITS(0, 11)                      /*!< analog watchdog 0 high threshold */

/* ADC_WDLT */
#define ADC_WDLT0_WDLT0                 BITS(0, 11)                      /*!< analog watchdog 0 low threshold */

/* ADC_RSQx x=0..2 */
#define ADC_RSQX_RSQN                   BITS(0, 4)                       /*!< n conversion in regular sequence */
#define ADC_RSQ0_RL                     BITS(20, 23)                     /*!< regular channel sequence length */

/* ADC_ISQ */
#define ADC_ISQ_ISQN                    BITS(0, 4)                       /*!< n conversion in regular sequence */
#define ADC_ISQ_IL                      BITS(20, 21)                     /*!< inserted sequence length */

/* ADC_IDATAx x=0..3 */
#define ADC_IDATAX_IDATAN               BITS(0, 15)                      /*!< inserted channel x conversion data  */

/* ADC_RDATA */
#define ADC_RDATA_RDATA                 BITS(0, 15)                      /*!< regular data */
#define ADC_RDATA_ADC1RDTR              BITS(16, 31)                     /*!< ADC1 regular channel data */

/* ADC_OVSAMPCTL */
#define ADC_OVSAMPCTL_OVSEN             BIT(0)                           /*!< oversampling enable */
#define ADC_OVSAMPCTL_OVSR              BITS(2, 4)                       /*!< oversampling ratio */
#define ADC_OVSAMPCTL_OVSS              BITS(5, 8)                       /*!< oversampling shift */
#define ADC_OVSAMPCTL_TOVS              BIT(9)                           /*!< triggered oversampling */
#define ADC_OVSAMPCTL_DRES              BITS(12, 13)                     /*!< ADC resolution */

/* ADC_WD1SR */
#define ADC_WD1SR_AWD1CS                BITS(0, 17)                      /*!< analog watchdog 1 channel selection */

/* ADC_WD2SR */
#define ADC_WD2SR_AWD2CS                BITS(0, 17)                      /*!< analog watchdog 2 channel selection */

/* ADC_WDT1 */
#define ADC_WDT1_WDLT1                  BITS(0, 7)                       /*!< analog watchdog 1 low threshold */
#define ADC_WDT1_WDHT1                  BITS(16, 23)                     /*!< analog watchdog 1 high threshold */

/* ADC_WDT2 */
#define ADC_WDT2_WDLT2                  BITS(0, 7)                       /*!< analog watchdog 2 low threshold */
#define ADC_WDT2_WDHT2                  BITS(16, 23)                     /*!< analog watchdog 2 high threshold */

/* ADC_DIFCTL */
#define ADC_DIFCTL_DIFCTL               BITS(0, 17)                      /*!< Differential mode for channel 17..0 */

/* constants definitions */
/* ADC flag definitions */
#define ADC_FLAG_WDE0                            ADC_STAT_WDE0                               /*!< analog watchdog 0 event flag */
#define ADC_FLAG_EOC                             ADC_STAT_EOC                                /*!< end of conversion */
#define ADC_FLAG_EOIC                            ADC_STAT_EOIC                               /*!< inserted channel end of conversion */
#define ADC_FLAG_STIC                            ADC_STAT_STIC                               /*!< inserted channel start flag */
#define ADC_FLAG_STRC                            ADC_STAT_STRC                               /*!< regular channel start flag */
#define ADC_FLAG_WDE1                            ADC_STAT_WDE1                               /*!< analog watchdog 1 event flag */
#define ADC_FLAG_WDE2                            ADC_STAT_WDE2                               /*!< analog watchdog 2 event flag */

/* ADC_CTL0 register value */
#define CTL0_DISNUM(regval)                      (BITS(13, 15) & ((uint32_t)(regval) << 13)) /*!< write value to ADC_CTL0_DISNUM bit field */

/* ADC special function definitions */
#define ADC_SCAN_MODE                            ADC_CTL0_SM                                 /*!< scan mode */
#define ADC_INSERTED_CHANNEL_AUTO                ADC_CTL0_ICA                                /*!< inserted channel group convert automatically */
#define ADC_CONTINUOUS_MODE                      ADC_CTL1_CTN                                /*!< continuous mode */

/* ADC synchronization mode */
#define CTL0_SYNCM(regval)                       (BITS(16, 19) & ((uint32_t)(regval) << 16)) /*!< write value to ADC_CTL0_SYNCM bit field */
#define ADC_MODE_FREE                                        CTL0_SYNCM(0)                   /*!< all the ADCs work independently */
#define ADC_DAUL_REGULAL_PARALLEL_INSERTED_PARALLEL          CTL0_SYNCM(1)                   /*!< ADC0 and ADC1 work in combined regular parallel + inserted parallel mode */
#define ADC_DAUL_REGULAL_PARALLEL_INSERTED_ROTATION          CTL0_SYNCM(2)                   /*!< ADC0 and ADC1 work in combined regular parallel + trigger rotation mode */
#define ADC_DAUL_INSERTED_PARALLEL_REGULAL_FOLLOWUP_FAST     CTL0_SYNCM(3)                   /*!< ADC0 and ADC1 work in combined inserted parallel + follow-up fast mode */
#define ADC_DAUL_INSERTED_PARALLEL_REGULAL_FOLLOWUP_SLOW     CTL0_SYNCM(4)                   /*!< ADC0 and ADC1 work in combined inserted parallel + follow-up slow mode */
#define ADC_DAUL_INSERTED_PARALLEL                           CTL0_SYNCM(5)                   /*!< ADC0 and ADC1 work in inserted parallel mode only */
#define ADC_DAUL_REGULAL_PARALLEL                            CTL0_SYNCM(6)                   /*!< ADC0 and ADC1 work in regular parallel mode only */
#define ADC_DAUL_REGULAL_FOLLOWUP_FAST                       CTL0_SYNCM(7)                   /*!< ADC0 and ADC1 work in follow-up fast mode only */
#define ADC_DAUL_REGULAL_FOLLOWUP_SLOW                       CTL0_SYNCM(8)                   /*!< ADC0 and ADC1 work in follow-up slow mode only */
#define ADC_DAUL_INSERTED_TRRIGGER_ROTATION                  CTL0_SYNCM(9)                   /*!< ADC0 and ADC1 work in trigger rotation mode only */

/* ADC calibration times */
#define CTL1_CLBNUM(regval)                      (BITS(4, 6) & ((uint32_t)(regval) << 4))    /*!< write value to ADC_CTL1_CLBNUM bit field */
#define ADC_CALIBRATION_NUM1                     CTL1_CLBNUM(0)                              /*!< ADC calibration 1 time */
#define ADC_CALIBRATION_NUM2                     CTL1_CLBNUM(1)                              /*!< ADC calibration 2 times */
#define ADC_CALIBRATION_NUM4                     CTL1_CLBNUM(2)                              /*!< ADC calibration 4 times */
#define ADC_CALIBRATION_NUM8                     CTL1_CLBNUM(3)                              /*!< ADC calibration 8 times */
#define ADC_CALIBRATION_NUM16                    CTL1_CLBNUM(4)                              /*!< ADC calibration 16 times */
#define ADC_CALIBRATION_NUM32                    CTL1_CLBNUM(5)                              /*!< ADC calibration 32 times */

