GigaDevice-GD32-MCU/GD32A508_Firmware_Library/Firmware/GD32A508_standard_peripheral/Include/gd32a508_adc.h
/* ADC data alignment */
#define ADC_DATAALIGN_RIGHT                      ((uint32_t)0x00000000U)                     /*!< LSB alignment */
#define ADC_DATAALIGN_LEFT                       ADC_CTL1_DAL                                /*!< MSB alignment */

/* ADC external trigger select for regular channel */
#define CTL1_ETSRC(regval)                       (BITS(17, 19) & ((uint32_t)(regval) << 17)) /*!< write value to ADC_CTL1_ETSRC bit field */
#define ADC0_1_EXTTRIG_REGULAR_T0_CH0            CTL1_ETSRC(0)                               /*!< TIMER0 CH0 event select */
#define ADC0_1_EXTTRIG_REGULAR_T0_CH1            CTL1_ETSRC(1)                               /*!< TIMER0 CH1 event select */
#define ADC0_1_EXTTRIG_REGULAR_T0_CH2            CTL1_ETSRC(2)                               /*!< TIMER0 CH2 event select */
#define ADC0_1_EXTTRIG_REGULAR_T1_CH1            CTL1_ETSRC(3)                               /*!< TIMER1 CH1 event select */
#define ADC0_1_EXTTRIG_REGULAR_T2_TRGO           CTL1_ETSRC(4)                               /*!< TIMER2 TRGO event select */
#define ADC0_1_EXTTRIG_REGULAR_T3_CH3            CTL1_ETSRC(5)                               /*!< TIMER3 CH3 event select */
#define ADC0_1_EXTTRIG_REGULAR_T7_TRGO           CTL1_ETSRC(6)                               /*!< TIMER7 TRGO event select */
#define ADC0_1_EXTTRIG_REGULAR_EXTI_11           CTL1_ETSRC(6)                               /*!< external interrupt line 11 */
#define ADC0_1_EXTTRIG_REGULAR_NONE              CTL1_ETSRC(7)                               /*!< software trigger */
#define ADC0_1_EXTTRIG_REGULAR_SHRTIMER_ADCTRG0  (ADC_CTL1_ETSRC4 | CTL1_ETSRC(0))           /*!< SHRTIMER_ADCTRG0 output select */
#define ADC0_1_EXTTRIG_REGULAR_SHRTIMER_ADCTRG2  (ADC_CTL1_ETSRC4 | CTL1_ETSRC(1))           /*!< SHRTIMER_ADCTRG2 output select */


/* ADC external trigger select for inserted channel */
#define CTL1_ETSIC(regval)                       (BITS(12, 14) & ((uint32_t)(regval) << 12)) /*!< write value to ADC_CTL1_ETSIC bit field */
#define ADC0_1_EXTTRIG_INSERTED_T0_TRGO          CTL1_ETSIC(0)                               /*!< TIMER0 TRGO event select */
#define ADC0_1_EXTTRIG_INSERTED_T0_CH3           CTL1_ETSIC(1)                               /*!< TIMER0 CH3 event select */
#define ADC0_1_EXTTRIG_INSERTED_T1_TRGO          CTL1_ETSIC(2)                               /*!< TIMER1 TRGO event select */
#define ADC0_1_EXTTRIG_INSERTED_T1_CH0           CTL1_ETSIC(3)                               /*!< TIMER1 CH0 event select */
#define ADC0_1_EXTTRIG_INSERTED_T2_CH3           CTL1_ETSIC(4)                               /*!< TIMER2 CH3 event select */
#define ADC0_1_EXTTRIG_INSERTED_T3_TRGO          CTL1_ETSIC(5)                               /*!< TIMER3 TRGO event select */
#define ADC0_1_EXTTRIG_INSERTED_T7_CH3           CTL1_ETSIC(6)                               /*!< TIMER7 CH3 event select */
#define ADC0_1_EXTTRIG_INSERTED_EXTI_15          CTL1_ETSIC(6)                               /*!< external interrupt line 15 */
#define ADC0_1_EXTTRIG_INSERTED_NONE             CTL1_ETSIC(7)                               /*!< software trigger */
#define ADC0_1_EXTTRIG_INSERTED_SHRTIMER_ADCTRG1 (ADC_CTL1_ETSIC4 | CTL1_ETSIC(0))           /*!< SHRTIMER_ADCTRG1 output select */
#define ADC0_1_EXTTRIG_INSERTED_SHRTIMER_ADCTRG3 (ADC_CTL1_ETSIC4 | CTL1_ETSIC(1))           /*!< SHRTIMER_ADCTRG3 output select */

/* ADC_SAMPTX register value */
#define SAMPTX_SPT(regval)                       (BITS(0, 2) & ((uint32_t)(regval) << 0))    /*!< write value to ADC_SAMPTX_SPT bit field */
#define ADC_SAMPLETIME_1POINT5                   SAMPTX_SPT(0)                               /*!< 1.5 sampling cycles */
#define ADC_SAMPLETIME_7POINT5                   SAMPTX_SPT(1)                               /*!< 7.5 sampling cycles */
#define ADC_SAMPLETIME_13POINT5                  SAMPTX_SPT(2)                               /*!< 13.5 sampling cycles */
#define ADC_SAMPLETIME_28POINT5                  SAMPTX_SPT(3)                               /*!< 28.5 sampling cycles */
#define ADC_SAMPLETIME_41POINT5                  SAMPTX_SPT(4)                               /*!< 41.5 sampling cycles */
#define ADC_SAMPLETIME_55POINT5                  SAMPTX_SPT(5)                               /*!< 55.5 sampling cycles */
#define ADC_SAMPLETIME_71POINT5                  SAMPTX_SPT(6)                               /*!< 71.5 sampling cycles */
#define ADC_SAMPLETIME_239POINT5                 SAMPTX_SPT(7)                               /*!< 239.5 sampling cycles */

/* ADC data offset for inserted channel x */
#define IOFFX_IOFF(regval)                       (BITS(0, 11) & ((uint32_t)(regval) << 0))

/* ADC analog watchdog 0 high threshold */
#define WDHT0_WDHT0(regval)                      (BITS(0, 11) & ((uint32_t)(regval) << 0))

/* ADC analog watchdog 0 low  threshold */
#define WDLT0_WDLT0(regval)                      (BITS(0, 11) & ((uint32_t)(regval) << 0))

/* ADC analog watchdog 1 high threshold */
#define WDT1_WDHT1(regval)                       (BITS(16, 23) & ((uint32_t)(regval) << 16))

/* ADC analog watchdog 1 low threshold */
#define WDT1_WDLT1(regval)                       (BITS(0, 7) & ((uint32_t)(regval) << 0))

/* ADC analog watchdog 2 high threshold */
#define WDT2_WDHT2(regval)                       (BITS(16, 23) & ((uint32_t)(regval) << 16))

/* ADC analog watchdog 2 low threshold */
#define WDT2_WDLT2(regval)                       (BITS(0, 7) & ((uint32_t)(regval) << 0))

/* ADC regular channel group length */
#define RSQ0_RL(regval)                          (BITS(20, 23) & ((uint32_t)(regval) << 20))

/* ADC inserted channel group length */
#define ISQ_IL(regval)                           (BITS(20, 21) & ((uint32_t)(regval) << 20))

/* adc_ovsampctl register value */
/* ADC resolution */
#define OVSAMPCTL_DRES(regval)                   (BITS(12, 13) & ((uint32_t)(regval) << 12)) /*!< write value to ADC_OVSAMPCTL_DRES bit field */
#define ADC_RESOLUTION_12B                       OVSAMPCTL_DRES(0)                           /*!< 12-bit ADC resolution */
#define ADC_RESOLUTION_10B                       OVSAMPCTL_DRES(1)                           /*!< 10-bit ADC resolution */
#define ADC_RESOLUTION_8B                        OVSAMPCTL_DRES(2)                           /*!< 8-bit ADC resolution */
#define ADC_RESOLUTION_6B                        OVSAMPCTL_DRES(3)                           /*!< 6-bit ADC resolution */

/* oversampling shift */
#define OVSAMPCTL_OVSS(regval)                   (BITS(5, 8) & ((uint32_t)(regval) << 5))    /*!< write value to ADC_OVSAMPCTL_OVSS bit field */
#define ADC_OVERSAMPLING_SHIFT_NONE              OVSAMPCTL_OVSS(0)                           /*!< no oversampling shift */
#define ADC_OVERSAMPLING_SHIFT_1B                OVSAMPCTL_OVSS(1)                           /*!< 1-bit oversampling shift */
#define ADC_OVERSAMPLING_SHIFT_2B                OVSAMPCTL_OVSS(2)                           /*!< 2-bit oversampling shift */
#define ADC_OVERSAMPLING_SHIFT_3B                OVSAMPCTL_OVSS(3)                           /*!< 3-bit oversampling shift */
#define ADC_OVERSAMPLING_SHIFT_4B                OVSAMPCTL_OVSS(4)                           /*!< 4-bit oversampling shift */
#define ADC_OVERSAMPLING_SHIFT_5B                OVSAMPCTL_OVSS(5)                           /*!< 5-bit oversampling shift */
#define ADC_OVERSAMPLING_SHIFT_6B                OVSAMPCTL_OVSS(6)                           /*!< 6-bit oversampling shift */
#define ADC_OVERSAMPLING_SHIFT_7B                OVSAMPCTL_OVSS(7)                           /*!< 7-bit oversampling shift */
#define ADC_OVERSAMPLING_SHIFT_8B                OVSAMPCTL_OVSS(8)                           /*!< 8-bit oversampling shift */

